// Завдання 3: Генерація таблиці множення

// Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .

// Виберіть число для якого потрібно згенерувати таблицю множення.
// Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
// Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.

console.log("loop for");
const number = 5;
for ( let i = 1; i <= 10; i++) {
    const ansver = number * i;
    console.log(`${number} * ${i} = ${ansver}`);
}

console.log("loop wile");
let i = 1;
while (i <= 10) {
    const ansver = number * i;
   console.log(`${number} * ${i} = ${ansver}`);
    i++;
}